#-------------------------------------------------------------------------------
# Taps
#-------------------------------------------------------------------------------

tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/services'

#-------------------------------------------------------------------------------
# Make sure apps get installed in system Applications dir
#-------------------------------------------------------------------------------

cask_args appdir: '/Applications'

#-------------------------------------------------------------------------------
# Install Binaries
#-------------------------------------------------------------------------------

brew 'git'
brew 'openssl'
brew 'pandoc'
brew 'wget'

#-------------------------------------------------------------------------------
# PHP
#-------------------------------------------------------------------------------

brew 'php@7.3'
brew 'composer'
brew 'phpunit'

#-------------------------------------------------------------------------------
# Node
#-------------------------------------------------------------------------------

brew 'node'
brew 'nvm'

#-------------------------------------------------------------------------------
# Ruby
#-------------------------------------------------------------------------------

brew 'ruby'
brew 'rbenv'

#-------------------------------------------------------------------------------
# Python (includes pip, easy_install)
#-------------------------------------------------------------------------------

brew 'python'
brew 'python3'
brew 'pyenv-virtualenv'

#-------------------------------------------------------------------------------
# Kubernetes
#-------------------------------------------------------------------------------

brew 'kubectl'
brew 'minikube'

#-------------------------------------------------------------------------------
# Apps
#-------------------------------------------------------------------------------

cask 'bestres'
cask 'clipy'
cask 'discord'
cask 'docker'
cask 'google-chrome'
cask 'iterm2'
cask 'rectangle'
cask 'sequel-pro'
cask 'slack'
cask 'visual-studio-code'

#-------------------------------------------------------------------------------
# Mac AppStore CommandLine Interface(mas-cli)
#-------------------------------------------------------------------------------

brew 'mas'

#-------------------------------------------------------------------------------
# Fonts
#-------------------------------------------------------------------------------

cask 'font-cascadia-code-pl'
